{
  "summary": "Kokenut full stack -kehittäjä, joka muuttaa sekavat, todellisen maailman ongelmat kestäviksi tuotteiksi — 0→1 MVP:stä vakaiksi, skaalautuviksi alustoiksi — tiiviissä yhteistyössä sidosryhmien kanssa ja tiukoissa, ennustettavissa sykleissä toimittaen. Nojaudun mittaamiseen, selkeään rajaukseen ja pragmaattiseen arkkitehtuuriin pienentääkseni riskiä, nopeuttaakseni palautekiertoa ja pitääkseni näkymät sekä työnkulut responsiivisina datan ja käyttäjien kasvaessa. Matkan varrella dokumentoin toimintamalleja, mentoroin tiimiä ja nostan rimaa luotettavuudessa, vaatimustenmukaisuudessa ja toimituslaadussa.",
  "story": {
    "title": "Tarinani",
    "text": "Olen kokenut ohjelmistokehittäjä, joka tykkää muuttaa sotkuiset ideat käyttökelpoisiksi tuotteiksi. Aloitan tarkoituksella pienestä — määritän tavoitteen, karsin melun, toimitan ensimmäisen siivun — ja kiristän silmukkaa, kunnes tuote tuntuu rauhalliselta ja luotettavalta. Sama rytmi näkyy tiimityössä: selkeät tavoitteet, rehellinen rajaus, tasainen tekeminen ja taipumus kirjoittaa asiat ylös, jotta vauhti ei nojaa muistiin. Kasvan suuntaan, jossa nämä tavat skaalautuvat — suunnan asettaminen, fokuksen suojeleminen ja muiden auttaminen tekemään parastaan — koska hyvä ohjelmisto on yhtä paljon ihmisten ja tahdin kuin koodin ansiota. Tavoite pysyy yksinkertaisena: rakentaa asioita, jotka helpottavat jonkun arkea, ja jättää järjestelmä aina parempaan kuntoon kuin sen löysin. Vapaa-ajalla palaudun tenniskentällä tai shakkilaudan ääressä — liike tuo tilaa päähän, strategia kärsivällisyyttä. Seuraan Formula 1:tä sen tarkkuuden ja tiimityön takia, ja luen laajasti pitääkseni ajattelun terävänä ja näkökulman avarana. Yhdistelmä on mutkaton, mutta pitää minut maanläheisenä ja uteliaana — jotta kun palaan rakentamaan, tuon mukana fokusta, energiaa ja parempia kysymyksiä.",
    "photo": "/images/me.jpeg"
  },
  "experiences": [
    {
      "id": "communere",
      "company": "Communere",
      "role": "Kokenut Full-Stack-kehittäjä",
      "dates": "May 2023 – Jul 2025",
      "description": "Viemme MARS-alustan konseptista tuotantoon, jotta kliinikot voivat hakea, tarkastella ja täyttää lomakkeita nopeammin; otimme käyttöön puheesta lomakkeiksi -toiminnallisuuksia, paransimme taustaprosessien luotettavuutta ja tuotimme auditointeihin tarvittavat vaatimustenmukaisuusmateriaalit. Lyhensimme rakennusaikoja merkittävästi ja loimme tiimin rutiinit, joiden ansiosta toimitus pysyi nopeana ja ennustettavana. Johdin kehittäjiä frontendissä ja backendissä kohti selkeämpää omistajuutta ja vähemmän regressioita.",
      "logoUrl": "/images/communere-white.png",
      "url": "https://communere.com/"
    },
    {
      "id": "selectedgeeks",
      "company": "Selected Geeks",
      "role": "Kokenut Frontend-kehittäjä",
      "dates": "May 2021 – May 2023",
      "description": "Toimitin laajan hallintakäyttöliittymän, jossa oli itsenäisiä moduuleja ja yhteiset design-standardit, mikä lyhensi integrointiaikaa ja teki julkaisuista turvallisempia. Paransin sivujen lataus- ja vuorovaikutusaikoja dataintensiivisissä näkymissä, lisäsin vahvempaa testausta ja näkyvyyttä tuotantoon sekä mahdollistin monialuejulkaisut ilman koodipohjien haarauttamista.",
      "logoUrl": "/images/selected.png",
      "url": "https://www.selectedgeeks.com/"
    },
    {
      "id": "bugloos",
      "company": "Bugloos",
      "role": "Frontend-kehittäjä",
      "dates": "Oct 2020 - May 2021",
      "description": "Toimitin monialustaisen kuluttajasovelluksen ja otin käyttöön julkaisuautomaation sekä komponenttikurin, jotka paransivat modulaarisuutta ja nopeuttivat käyttöönottoja.",
      "logoUrl": "/images/bugloos.png",
      "url": "https://bugloos.com/"
    },
    {
      "id": "sedevs",
      "company": "SEDevs",
      "role": "Frontend-kehittäjä",
      "dates": "Jan 2019 - Apr 2020",
      "description": "Rakensin hallintanäkymiä ja CRM:n, joka vähensi manuaalista käsittelyä noin 60 %. Julkaisin reaaliaikaisen palveluportaalin, joka paransi vasteaikoja ja kumppanien kasvua, ja rakensin kevyet toimintakäytännöt pienen tiimin tasaisen käytettävyyden varmistamiseksi.",
      "logoUrl": "/images/sedevs.png",
      "url": "https://sedevs.com/"
    }
  ],
  "contactInfo": {
    "phone": "+358 44 952 9398",
    "email": "contact@habibshaban.dev"
  }
}
